{"author": null, "date": "FEBRUARY 3, 2025 AT 7:22PM", "text": "Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Chief Brian O’Hara said staffing issues have exacerbated backlogs on MPD’s side. FEBRUARY 3, 2025 AT 7:22PM From left, Minneapolis City Attorney Kristyn Anderson, Community Safety Commissioner Todd Barnette, Police Chief Brian O’Hara and Civil Rights Director Michelle Phillips speak during a news conference at City Hall in Minneapolis on Monday. (Jerry Holt/The Minnesota Star Tribune) Minneapolis is struggling to eliminate backlogs of police misconduct complaints and officer use-of-force reviews, largely due to a staffing deficit, though the city has made strides in other reform goals since March 2024, according to an evaluator’s report released Monday. The report, by Washington, D.C.-based independent monitor group Effective Law Enforcement For All, is the first to measure the city’s progress in complying with the terms of a settlement struck with the Minnesota Department of Human Rights after the 2020 police killing of George Floyd. As of last September, the Police Department still had more than 1,100 force cases in queue for review by command staff, a mandatory process when an officer restrains a person, uses a Taser or baton, fires a gun or uses any other measure of force. “Of greater concern,” the report says, is that 15 of those were classified as “critical incidents,” such as an officer-involved shooting. The report also cites lags in misconduct complaints handled by the Police Department’s internal affairs unit and the city’s Office of Police Conduct Review. As of Jan. 30, internal affairs counted 44 cases as backlog, according to data presented to a city committee recently. The Office of Police Conduct Review had 83 complaints in queue that were over a month old, a separate report shows. Minneapolis Police Chief Brian O’Hara said Monday morning the department has trained more members of the command staff to help conduct the internal affairs investigations and opened up overtime hours to expedite the process. The city has also contracted with a law firm to help with the force reviews, he said. “I can’t say with certainty that the backlog will be cleared by the deadline,” O’Hara said. “But I feel very, very confident that if not cleared, we will have made substantial progress. It still remains to be seen.” Similarly, said Civil Rights Director Michelle Phillips, the Office of Police Conduct Review is also still facing a backlog in part due to staffing issues. “The bottom line: There is still backlog,” Phillips said. “Butb wiaes :arLee amna LkeifntgB piaros gsrpelist sa.”cross 3 sources 33% 67% Other sources +-1 https://www.startribune.com/mpd-touts-progress-in-police-reforms-but-lags-in-closing-out-complaints-and-force-reviews/601216318 1/4 2/4/25, 10:45 AM Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews The deadline to eliminate or make “substantial progress” to clearing the backlogs is March 17, the one-year anniversary of the monitor’s contract going into effect. David Douglass, one of the court-appointed monitors, called the deadline “artificial,” noting it’s part of a working agreement with the city and not mandated in the settlement. “A lot of progress is being made,” Douglass said in an interview Monday. “We’ve worked closely with them all along the way and we’re comfortable with that.” As a whole, several city leaders touted the report as evidence of the progress the city has made since entering into the court-enforceable agreement with the state, on track to comply with several of the one-year goals. Much of that work comes in the form of writing or revising confusing and ineffectual policies, addressing technical or equipment issues and revising training. O’Hara said the department has overhauled the field-training program, as an example. “This is the beginning of a long journey that will take time,” said Community Safety Commissioner Todd Barnette, “but the city is fully on board and working diligently toward sustainable reform beyond compliance with the settlement agreement.” The Minnesota Department of Human Rights agreement is expected to last at least four years. Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Paul Walsh", "date": "JANUARY 30, 2025 AT 6:48AM", "text": "Teen pleads guilty to ‘Nudieland’ mass shooting that killed musician, wounded others in Minneapolis “This was a senseless attack on members of our LGBTQ+ community,” County Attorney Mary Moriarty said in a statement. By Paul Walsh The Minnesota Star Tribune JANUARY 30, 2025 AT 6:48AM Hennepin County Attorney Mary Moriarty speaks during a news conference at the Hennepin County Government Center in Minneapolis on Tuesday, April 23, shortly after a teenage suspect in the “Nudieland” mass shooting case made his first appearance in court. (Alex Kormann/The Minnesota Star Tribune) A teenager pleaded guilty Wednesday in connection with him unleashing gunfire that killed one person and wounded six others at a backyard concert in Minneapolis nearly 1½ years ago. Dominic James Burris, 18, of Hinckley, Minn., admitted in Hennepin County District Court to aiding and abetting second-degree intentional murder and aiding and abetting first-degree assault, great bodily harm, stemming from the mass shooting on Aug. 11, 2023, at the DIY pop-up punk venue known as “Nudieland,” an LGBTQ-friendly community. Nicholas August Golden, 35, was killed while celebrating a birthday and watching live music with others in the 2200 block of 16th Avenue S. Golden was a musician and songwriter and deeply involved in the punk scene in Minneapolis and around the country. bias: Lean Left Bias split across 4 sources 75% 25% Other sources https://www.startribune.com/teen-pleads-guilty-to-carrying-out-nudieland-mass-shooting-that-killed-musician-wounded-others/601213797 1/5 2/4/25, 10:43 AM Teen pleads guilty to carrying out ‘Nudieland’ mass shooting in Twin Cities that killed 1, wounded 5 August Golden was killed in the August 2023 mass shooting at the DIY punk venue Nudieland. (Provided by Bryan May) The plea agreement between the prosecution and the defense calls for Burris to receive a sentence of slightly more than 23 years. With credit for time in jail since his arrest, he is expected to serve just shy of 15 years in prison and the balance on supervised release. Burris is scheduled to be sentenced on March 24. “This was a senseless attack on members of our LGBTQ+ community who were enjoying an evening of music and camaraderie in Minneapolis,” County Attorney Mary Moriarty said in a statement. “I have been continually amazed by the strength of those close to August throughout this process.” Dominic James Burris (Hennepin County jail) Co-defendant Cyrell Boyd, 18, of Onamia, Minn., pleaded guilty and was sentenced in November for aiding an offender after the fact. The agreement required him to assist in the prosecution of Burris. Moriarty said Boyd provided evidence allowing the prosecution to develop an “ironclad” case against Burris, who she said “repeatedly and intentionally fired his gun” into the crowd. bias: Lean Left Bias split across 4 sources 75% 25% Other sources https://www.startribune.com/teen-pleads-guilty-to-carrying-out-nudieland-mass-shooting-that-killed-musician-wounded-others/601213797 2/5 2/4/25, 10:43 AM Teen pleads guilty to carrying out ‘Nudieland’ mass shooting in Twin Cities that killed 1, wounded 5 Plea terms for Boyd call for him to be incarcerated at the state juvenile correctional facility in Red Wing. When he turns 21, he will return to court, where he will be certified as an adult and plead guilty to three additional charges: second-degree assault, aiding and abetting first-degree assault and aiding and abetting second-degree assault. His prison sentence for those offenses will be set aside, and Boyd will be placed on probation for five years, when he turns 26. According to court documents: Burris and Boyd came to the show, made advances toward a woman they did not know and became hostile when they were rejected. She noticed they had guns and commented on it. One of the teens told her, “we’re not going to use the gun or anything, but if need be, we will.” Other witnesses heard Burris and Boyd using epithets to describe the sexual orientation of people in the crowd. After Burris and Boyd left the party, gunshots erupted less than a minute later from behind a fence in a neighbor’s yard. Investigators used surveillance video, forensic evidence and witness statements to build their case against Burris and Boyd, including DNA from a cigarette that matched Boyd’s. They found eight 9-millimeter shell casings and one .380-caliber shell casing in a neighbor’s yard. Jeff Day of the Minnesota Star Tribune contributed to this story. Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Deena Winter", "date": "JANUARY 30, 2025 AT 11:14AM", "text": "Minneapolis will pay $600K to settle suit by woman Derek Chauvin violently arrested for drunken driving Patty Day had been drinking and was sitting in her van when Chauvin yanked her out, threw her on the ground and arrested her for drunken driving. By Deena Winter The Minnesota Star Tribune JANUARY 30, 2025 AT 11:14AM Patty Day said Minneapolis police officer Derek Chauvin cracked her tooth, bruised her body and injured her arm during an arrest in January 2020. (Jerry Holt) Patty Day was sitting in her Volkswagen minivan on a snowy south Minneapolis street on Jan. 17, 2020, when a police officer came up to the car and soon yanked her out, threw her face-down on the street and ground his knee into her back. About four months later, that officer, Derek Chauvin, made headlines and sparked protests across the globe for taking a similar approach to a man named George Floyd. Except that time, Floyd died under Chauvin’s knee on a south Minneapolis street as the world later watched in horror. Day was struggling with a divorce and had been drinking too much before getting in her van, but she said Chauvin immediately escalated the situation, cracking her tooth, bruising her body and injuring her arm and shoulder before handcuffing her and pressing his knee into her back as he cuffed her and she cried out in pain. “The look in his eye was so evil. I feared for my life. I didn’t know if I was going to survive this. It all escalated so quickly,” she told the Minnesota Star Tribune last year, when she filed a federal civil rights lawsuit against Chauvin, the city and Chauvin’s former partner, Ellen Jensen, alleging Chauvin was a “long-troubled officer with a documented pattern of misconduct, to which MPD and city leaders willfully turned a blind eye.” The lawsuit alleged the city had a longstanding practice of “unchecked Fourth Amendment violations” by police and sought at least $9 million in damages, but it will be settled for $600,000 after it was approved by the Minneapolis City Council after a closed-door session Thursday. The vote was 10-0, with Council Members Jamal Osman absent and Linea Palmisano recused because Day used to be her policy aide. According to the settlement, $175,000 will go to Day and $425,000 to her attorneys. The lawsuit was bought by the Robins Kaplan law firm, where lawyer Bob Bennett has made a career of winning large settlements with the city over police brutality cases. In 2023, Bennett won settlements of $7.5 million and $1.4 million due to Chauvin’s violent treatment of John Pope Jr. and Zoya Code. https://www.startribune.com/minneapolis-lawsuit-settlement-patty-day-derek-chauvin/601214286 1/6 2/4/25, 10:44 AM Minneapolis settles suit with woman Derek Chauvin violently arrested “This kneeing maneuver was Defendant Chauvin’s calling card,” the lawsuit alleged. “Chauvin was a serial predator who was never stopped by the city.” bias: Lean Left Bias split across 31 sources 36% 38% 26% Other sources +38 ‘I wasn’t being combative' On the day she encountered Chauvin, Day was working in communications for the Minneapolis Public Works department. Struggling with an impending divorce, she spent that day drinking at home before leaving to pick up her child from daycare. After driving a couple of blocks, she realized she shouldn’t be driving, pulled over, turned off her van, threw the keys in the back and fell asleep crying, the lawsuit said. She used her remote starter to turn on the car and stay warm but wasn’t planning to drive any farther. Someone called 911 and reported an intoxicated person sitting in a vehicle stuck in a snowbank for several hours. About an hour later, at about 9 p.m., Chauvin and Jensen showed up. Jensen talked to Day for a bit before Chauvin reached into the van and grabbed Day’s left arm while Jensen grabbed the right. “They threw me fast down into the street in the snow very forcefully,” Day told the Star Tribune. “They didn’t ask me to get out of the car. I wasn’t being combative. I wasn’t being difficult. I just wanted them to know I wasn’t trying to drive.” She said Chauvin threw her in the squad car sideways with her bleeding hands cuffed tightly behind her back. A third officer arrived and arrested her for driving while intoxicated. In their police reports, Jensen and Chauvin said they merely ordered Day out of the van. As with other Chauvin incidents — such as Pope’s — no use-of-force incident report was filed, as required by Minneapolis Police Department policy. The lawsuit said the “city’s recalcitrance is unsurprising, as the city attorney’s office routinely uses faux confidentiality concerns under the Minnesota Government Data to withhold [body-worn camera] video from persons depicted thereon — despite clear law mandating its release.” Tests put Day’s blood alcohol level at 0.25%, roughly triple the legal threshold for driving, and she was charged with two misdemeanor counts of DUI. But Hennepin County District Judge Julie Allyn ordered the test results suppressed, saying the officers didn’t have probable cause to arrest Day, and the city dropped the charges in 2021. The lawsuit noted the city has paid nearly $80 million in the last two decades due to unconstitutional use of force by MPD officers and that the city’s 12 costliest settlements from 2006 to 2012 resulted in no officer discipline. “If the city refuses to pay for a good police force, it will pay dearly for a bad one,” the suit said. Robins Kaplan partner Katie Bennett said Chauvin really seemed to prey on vulnerable people at their lowest, unnecessarily using physical force, and Day wanted to hold the city accountable for “basically creating Chauvin.” “I think that’s powerful for plaintiffs to be able to do and stand up to Chauvin, the city’s monster.” Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Jeffrey Meitrodt", "date": "FEBRUARY 3, 2025 AT 9:31AM", "text": "Alleged ringleader in $250 million meals fraud case goes on trial this week Aimee Bock, who led Feeding Our Future, may testify in the trial. She will face the jury along with Salim Said, who owned Safari Restaurant in Minneapolis. By Jeffrey Meitrodt The Minnesota Star Tribune FEBRUARY 3, 2025 AT 9:31AM Aimee Bock, executive director of nonprofit Feeding Our Future, speaks to the Star Tribune on Jan. 27, 2022, just days after the FBI searched her St. Anthony offices. (Shari L. Gross/The Minnesota Star Tribune) Three years after FBI agents raided Aimee Bock’s home and business to kickstart one of the largest fraud investigations in Minnesota history, the alleged ringleader of an extraordinary pay-to-play scheme featuring dozens of co-conspirators will finally get her day in court Monday. During Bock’s much-anticipated trial, prosecutors will portray the controversial founder of a St. Anthony nonprofit known as Feeding Our Future as the mastermind who figured out how dozens of people could steal $250 million from a federal program meant to feed children in need, court records show. Bock has denied the allegations, saying she received no improper payments and was unaware of any fraud taking place. Her trial will be only the second in the sprawling case. Security measures will be bolstered after last year’s trial ended with an attempted bribe of a juror, a rare incident that drew international media attention and resulted in jurors being sequestered for their safety. Of the 70 people charged since 2022 in the massive case, 30 have pleaded guilty; five tied to a Shakopee restaurant were convicted by a jury last year, and two were acquitted. At least 13 of the defendants who pleaded guilty have been identified as potential witnesses for the prosecution in the coming trial, court records show. The trial is scheduled to last more than a month. Also going on trial this week is Salim Said, co-owner of Safari Restaurant, a once-small Minneapolis business that federal investigators have identified as one of the largest beneficiaries of the fraud scheme. Prosecutors have described the scheme as a brazen effort to get rich fast by falsely claiming to feed thousands of children every day at sites controlled by Feeding Our Future and its partners, including Safari Restaurant. https://www.startribune.com/alleged-ringleader-in-250-million-meals-fraud-case-goes-on-trial-this-week/601215790 1/7 2/4/25, 10:44 AM Aimee Bock, Feeding Our Future leader, takes case to jury trial bias: Lean Left Bias split across 4 sources 25% 75% Other sources +2 Feeding Our Future allegedly organized the fraud by recruiting participants willing to pay kickbacks for the chance to file reimbursement claims for millions of meals that were never provided. In 2021 alone, prosecutors say, Feeding Our Future received nearly $18 million in federal funds for its 10% cut of the action, allegedly camouflaged as “administrative fees.” What to expect at the trial The trial will start with jury selection. The process lasted four days in last year’s trial as attorneys struggled to find jurors who didn’t have strong opinions about the high-profile case. Prosecutors have said they will show the jury hundreds of documents, including emails, text messages between defendants, FBI surveillance video, invoices and checks tracing money to new luxury car and home purchases. Witnesses are expected to include FBI forensic accountants and case agents. The offices of Feeding Our Future are shown Jan. 27, 2022, a week after an FBI raid. (Shari L. Gross/The Associated Press) In a surprise twist, two defendants slated to join Bock and Said on trial pleaded guilty last week. Eight others charged with Bock in the same indictment are expected to stand trial in April and June. One defendant pleaded guilty in 2023, and another, Abdikerm Eidleh, a former Feeding Our Future employee, fled the country. Unlike many of her co-defendants who were accused of improperly diverting millions of dollars of federal funding for their own use, Bock has not been accused of buying expensive property or hiding money abroad. Prosecutors say she personally obtained $1.2 million in fraudulent proceeds, mostly by giving money to a construction firm owned by her then-boyfriend, court records show. As the head of Feeding Our Future, Bock paid herself $190,000 a year. After the FBI searched her business and home, she was forced to turn over $185,000 from her bank account and the keys to her 2013 Porsche Panamera. Authorities also seized $13,462 in cash from her. Prosecutors said bank records show Bock and her boyfriend used proceeds from the fraud to fund their personal lifestyle, including spending more than $50,000 on travel and “tens of thousands of dollars” on luxury purchases and jewelry. Since she was charged in September 2022, Bock has lost her Rosemount house and now lives with her parents, said her attorney, Kenneth Udoibok. He said Bock has been unable to find work since losing her job with a ridesharing company. https://www.startribune.com/alleged-ringleader-in-250-million-meals-fraud-case-goes-on-trial-this-week/601215790 2/7 2/4/25, 10:44 AM Aimee Bock, Feeding Our Future leader, takes case to jury trial bias: Lean Left Bias split across 4 sources 25% 75% Other sources +2 “If she did this, where’s the money?” Udoibok asked in an interview with the Minnesota Star Tribune last week. In a court filing, he said Bock “did not make any extravagant purchases,” and he denied she took a July 2021 trip to Las Vegas that the government says cost more than $20,000. Moreover, Bock said in the 2022 interview that her boyfriend’s company was paid more than $800,000 for doing legitimate renovation work at her nonprofit’s offices. Udoibok said Bock wants to testify at the trial, but he has not decided whether that would be the right move. “To make her the fall girl is unfair,” Udoibok said. “I am hoping the jury will see this. Aimee is an innocent woman.” Aimee Bock, executive director of nonprofit Feeding Our Future, speaks publicly for the first time days after the FBI searched her St. Anthony offices in January 2022. (Shari L. Gross/The Minnesota Star Tribune) According to court records, Said allegedly diverted as much as $10 million for his personal use by claiming his Lake Street restaurant provided more than 10,000 meals daily. Prosecutors say Said used some of the money to buy a $1.2 million home with an indoor basketball court in Plymouth, a $60,000 Mercedes and a $47,000 pickup truck. Said and other business partners also allegedly spent more than $5 million to buy commercial properties in Uptown Minneapolis and Columbus, Ohio, court records show. Said’s attorneys did not return a request for comment. ‘Vindictive’ prosecution The case centers around meal programs funded by the U.S. Department of Agriculture for low-income children after school and during the summer. Meal distribution sites are overseen by “sponsors,” like Feeding Our Future. Bock’s nonprofit oversaw more than 200 food distribution sites across Minnesota and quickly grew — from receiving about $3 million in federal funds in 2019 to nearly $200 million in 2021. In court filings, Udoibok argued that the government’s case is “potentially selective or vindictive” because Bock sued the Minnesota Department of Education, which administers the federal funding, in 2020 when the state agency tried to block the rapid growth of her operation. But prosecutors say Bock played a key role in the scheme. As head of Feeding Our Future, she was responsible for ensuring her providers were actually serving the huge number of meals they claimed to be. Instead, prosecutors said in a trial brief, Bock “gave false assurances” when state officials questioned the sky-high meal counts. In her 2022 interview with the Star Tribune, Bock maintained that she and other Feeding Our Future employees visited meal sites — many of which were overseen by individual nonprofits — as often as once a month to make sure they were following federal guidelines. “We have verified the nonprofits pass out the food,” she said at the time. “We have verified the nonprofits purchase the food.” “I don’t have a criminal mind,” she added. “Could I be outsmarted by somebody who is good at it? Sure. But I firmly believe that is not the case.” Hadith Ahmed, who said he was Bock’s “right-hand man” at Feeding Our Future, testified last year that the nonprofit had no checks and https://www.startribune.com/alleged-ringleader-in-250-million-meals-fraud-case-goes-on-trial-this-week/601215790 3/7 2/4/25, 10:44 AM Aimee Bock, Feeding Our Future leader, takes case to jury trial balances because employees did not review invoices or verify in person if newly created sites were operating. bias: Lean Left Bias split across 4 sources 25% 75% Other sources +2 Instead, Ahmed said, he and other employees accepted kickbacks from sites for looking the other way. “We were not visiting sites,” he testified. “We were all taking kickbacks.” Ahmed said Bock knew the meal sites were submitting fake children’s names to cover their tracks and that she once handed him a plastic bag full of $5,000 in cash. Udoibok sought in court filings to prevent Ahmed from testifying in this month’s trial. The attorney argued that Ahmed wasn’t credible because he said more than 80 times during cross-examination that he couldn’t recall information. U.S. District Judge Nancy Brasel, who is overseeing the case, denied the motion. Correction: A previous version of this story misstated the date of the start of the trial. It starts Monday."}
{"author": "By Deena Winter", "date": "FEBRUARY 3, 2025 AT 11:55AM", "text": "Who’s running for Minneapolis mayor and City Council in 2025 elections? Minneapolis’ 2025 city elections will include Mayor Jacob Frey defending his post and all 13 city council seats on the ballot. Here’s who’s announced so far. By Deena Winter The Minnesota Star Tribune FEBRUARY 3, 2025 AT 11:55AM The mayor and all 13 City Council seats will be on the 2025 Minneapolis elections ballot. (Glen Stubbe/The Minnesota Star Tribune) The keys to City Hall are up for grabs on Nov. 4, when all 13 City Council seats and the mayor’s office are up for election. Minneapolis has used ranked-choice voting since 2009. No primary election is held, so if there are more than two candidates in a race, people “rank” candidates with a first, second and third preference. That way, votes can count toward another candidate if your top candidate loses. Key dates: The official candidate filing period is from July 29 through Aug. 12. Early voting is from Sept. 19 through Nov. 3. Early voter registration is due Oct. 14. The deadline to apply for a mailed ballot is Oct. 28. Stay tuned here as announcements become official. If you’re planning to run, email deena.winter@startribune.com and dave.orrick@startribune.com. Here are the people who have announced so far, alphabetically by last name: Mayor DeWayne Davis, lead minister of Plymouth Congregational Church in Minneapolis, worked as a congressional staffer for 15 years and is the former director of federal relations for Sallie Mae Inc. In 2023, he was the first Black gay person elected as chaplain of the Minnesota Senate. He also co-chaired Mayor Jacob Frey’s Minneapolis Community Safety Work Group that recommended public safety reforms. He and his husband, Kareem Murphy, live in north Minneapolis. Website. Howard Dotson is a health care chaplain and bereavement counselor who has been Urban Presbyterian pastor for 12 years, police chaplain for four different departments, most recently street chaplain in Minneapolis for the past two years. Website. https://www.startribune.com/minneapolis-elections-2025-mayor-city-council-candidates-jacob-frey-ballot/601215337 1/9 2/4/25, 10:44 AM Who's running for Minneapolis mayor and city council in 2025 elections Omar Fateh is the first Somali American to serve in the Minnesota Senate and is believed to be the first in the United States. He’s also one of the few self-identified democratic socialists in the Legislature. He is married and lives in south Minneapolis. Website. Incumbent Jacob Frey is running for his third four-year term after being elected in 2017. Prior to that, he was a council member representing Ward 3. Before running for public office, Frey worked as an employment and civil rights attorney. He is married to Sarah Clark, and they have a daughter Frida, 4, and are expecting a second daughter in July. Website. Jazz Hampton and two friends quit their corporate jobs and created a company called TurnSignl after the Minneapolis police killing of George Floyd. The app connects drivers with lawyers who can give them legal advice during traffic stops and after vehicle collisions. He describes himself as a husband, father of three, community advocate, attorney, and business owner. Website. Emily Koski has represented Ward 11 in south Minneapolis since she was elected in 2021 after campaigning with Frey. Her father, the late Al Hofstede, was elected mayor in the 1970s after serving on the council. Koski worked for Target before owning a small business for more than a decade. She is married to Mike and has a son, Croix, and daughter, Iris. Website. Brenda Short says she grew up in a small town in Iowa, working in cornfields, bean fields, and a chicken farm. She and her three children were homeless in the Twin Cities before she found temporary shelter and worked various jobs before becoming a homeowner. Website. City Council Ward 1 Ward 1 lies in the northeast corner of the city. It includes Audubon Park, Bottineau, Columbia Park, Como, Holland, Logan Park, Marshall Terrace, Mid-City Industrial, Northeast Park, Waite Park and Windom Park. Incumbent Elliott Payne was elected in 2021 and is the president of the council. He previously worked at City Hall as a member of the Office of Performance and Innovation. He pushed to expand alternative responses to public safety by expanding the city’s mental health response and creating a public safety ambassador program along cultural corridors. Website. City Council Ward 2 Ward 2 stretches across the Mississippi River, on the eastern side of the city. Neighborhoods in this ward include Cedar Riverside, Como, Marcy Holmes, Prospect Park - East River Road, Seward and the University of Minnesota. Michael Baskins was a write-in candidate for Ward 2 in 2023 and received about 33% of the vote, deriding extreme rent control,” bans on clearing homeless encampments with open drug use and taxpayer-funded sidewalk plowing. (No website as of last check.) Incumbent Robin Wonsley was elected in 2021 and became Minneapolis’s first Black democratic socialist city council member. Wonsley served on the board of directors for the Restorative Justice Community Action Network; worked with a group that successfully fought for the $15 minimum wage in Minneapolis and St. Paul; and was a community organizer with the state teachers’ union, Education Minnesota. Website. City Council Ward 3 Ward 3 stretches from downtown north across the Mississippi River. Neighborhoods in this ward are: Beltrami, Como, Downtown East, Downtown West, Marcy Holmes, Nicollet Island - East Bank, North Loop, Sheridan, St. Anthony East and St. Anthony West. Incumbent Michael Rainville was elected in 2021 and worked in the hospitality industry as a dishwasher, busboy, and bartender before joining the Minneapolis Convention & Visitors Association. Website. Emilio César Rodríguez says he’s been fighting for climate policy and immigrant rights through the Drivers’ Licenses for All and North STAR Act movements. Website. Jacob Thomas says he’s been an organizer in Minnesota for over a decade and worked for his hometown police department’s community safety program, and served eight years in the U.S. Air Force working as a sexual assault victims advocate and serving as a volunteer firefighter. Website. https://www.startribune.com/minneapolis-elections-2025-mayor-city-council-candidates-jacob-frey-ballot/601215337 2/9 2/4/25, 10:44 AM Who's running for Minneapolis mayor and city council in 2025 elections City Council Ward 4 Ward 4 covers the northwest corner of the city. The Mississippi River serves as its eastern border. Neighborhoods in this ward are: Camden Industrial Area, Cleveland, Folwell, Humboldt Industrial Area, Jordan, Lind-Bohanon, McKinley, Shingle Creek, Victory, Webber-Camden and Willard-Hay. Marvina Haynes became an advocate when her brother, Marvin Haynes, was wrongfully convicted of murder, after which she founded MN Wrongfully Convicted Judicial Reform to help families. She ran for the council in Ward 4 in 2023. (No website as of last check.) Incumbent LaTrisha Vetaw worked at NorthPoint Health & Wellness, Inc. for 15 years, serving as the director of health policy and advocacy. She served on the Minneapolis Park Board before being elected to the council in 2021. Website. City Council Ward 5 Ward 5 also covers parts of northern Minneapolis. Its neighborhoods include Harrison, Hawthorne, Jordan, Near-North, North Loop, Sumner-Glenwood and Willard-Hay. (Incumbent Jeremiah Ellison is not seeking reelection.) Ethrophic Burnett has worked for the city for the past seven years, as an aide to former Council Member Phillipe Cunningham, and for the Neighborhood & Community Relations, the Office of Violence Prevention, and currently the City Auditor’s division of oversight and evaluation. Website. Pearll Warren is a spoken word artist, poet, comedian and writer who works as homeownership development manager for Twin Cities Habitat for Humanity. Website. Miles Wilson served on the board of the Unity Community Mediation Team, the Community Action Partnership of Hennepin County and the Young People’s Task Force. Website. Anndrea Young worked for anti-displacement funding from the Legislature and on the Blue Line Coalition, Zero Burn Coalition, Bring Back 6th Coalition and 394/I-94 work group. Website. City Council Ward 6 Ward 6 covers areas south and east of downtown, including Cedar Riverside, Elliot Park, Phillips West, Seward, Steven’s Square-Loring Heights and Ventura Village. Incumbent Jamal Osman was elected in 2020 and volunteers as a certified mental health first aid instructor, served on the Phillips Community Clinic Board, and volunteers with Open Arms of Minnesota preparing food. City Council Ward 7 Ward 7 covers parts of downtown then stretches west. Its neighborhoods include Bryn-Mawr, Cedar-Isles-Dean, Downtown West, East Isles, Kenwood, Linden Hills, Loring Park, Lowry Hill, Steven’s Square-Loring Heights and West Maka Ska. Incumbent Katie Cashman worked at the United Nations helping municipalities around the world build environmental and social infrastructure; founded a nonprofit that built a community education and resource center; and worked as a project manager at a public interest law firm called the Minnesota Center for Environmental Advocacy. She has served on the boards of Meet Minneapolis, the Clean Energy Partnership, the Family Housing Fund Board and the Minneapolis Tree Advisory Commission. She was elected in 2023. Website. Paula Chesley has worked as a professor and researcher but now teaches yoga and meditation in a mental health clinic. Chesley says she’s running for the council “to bring a renewed focus on safety, economic vitality, and responsive government” and will ensure the Minneapolis Police Department is “fully supported through effective recruitment efforts and fair compensation, while also insisting on accountability measures that rebuild trust with the community.” Website. Elizabeth Shaffer is a Minneapolis park commissioner whose community work began as a volunteer in Thomas Lowry Park, eventually resulting in her work to help rebuild and transform the Seven Pools. Website. City Council Ward 8 Ward 8 covers south-central Minneapolis, including the intersection of 38th Street and Chicago Avenue, where George Floyd was killed. This ward encompasses the Bancroft, Bryant, Central, Field, King Field, Lyndale, Northrop and Regina neighborhoods. (Incumbent Andrea Jenkins has not said whether she’s running for reelection.) Josh Bassais is a former DFL party precinct chair, organizer with the Laborers' International Union of North America, and board president for the Lyndale Neighborhood Association. Website. Soren Stevenson narrowly lost to incumbent Andrea Jenkins in 2023. During protests over George Floyd’s police killing, a Minneapolis police officer shot him in the face with a rubber bullet, destroying his left eye. He works for Agate Housing, which runs homeless shelters. Website. City Council Ward 9 Ward 9 covers central Minneapolis and also includes the intersection of 38th and Chicago where George Floyd was killed. Its neighborhoods include Central, Corcoran, East Phillips, Howe, Longfellow and Powderhorn Park. Incumbent Jason Chavez served as a legislative aide to state DFL Reps. Carlos Mariani and Mohamud Noor before being elected to the council in 2021. Website. https://www.startribune.com/minneapolis-elections-2025-mayor-city-council-candidates-jacob-frey-ballot/601215337 3/9 2/4/25, 10:44 AM Who's running for Minneapolis mayor and city council in 2025 elections Dan Orban was a website programmer at Dell Technologies, moved on to Accenture Technology Labs and worked as a software contractor, a website designer, and graphics programmer before becoming a Ph.D. student. Website. City Council Ward 10 Ward 10 covers an area commonly referred to as Uptown. Its neighborhoods include East Bde Maka Ska, East Harriet, East Isles, Lowry Hill East, South Uptown and Whittier. Incumbent Aisha Chughtai was campaign manager for U.S. Rep. Ilhan Omar and worked at Take Action Minnesota, and as a political organizer for the Service Employees International Union’s Minnesota State Council. She was elected in 2021. Website. Lydia Millard is executive director for the Stevens Square Community Organization and previously worked in large-scale operations for Target. Website. City Council Ward 11 Ward 11 covers south-central Minneapolis. Its neighborhoods include Diamond Lake, Field, Hale, Keewaydin, Northrop, Page, Tangletown, Wenonah and Windom. (Incumbent Emily Koski is running for mayor.) Jamison Whiting worked at Faegre Drinker, one of Minnesota’s largest law firms, in nonprofit and corporate law, but was inspired to make a “direct difference in public safety” after the police murder of George Floyd, and joined the Minneapolis City Attorney’s Office to work on police reform. Website. City Council Ward 12 Ward 12 covers the southeastern corner of the city, including Cooper, Ericsson, Hiawatha , Howe, Keewaydin, Minnehaha, Morris Park and Standish. Incumbent Aurin Chowdhury worked for a decade in grassroots organizing and coalition-building. She managed constituent services for the late Sen. Kari Dziedzic and was a policy aide to Council Member Steve Fletcher and then Jason Chavez before she was elected to the council in 2023. Website. Becka Thompson is a member of the Minneapolis Park & Recreation Board who taught math for over 20 years, has an MBA in finance and has been a professional actress for several decades. Website. City Council Ward 13 Ward 13 covers the southwestern corner of Minneapolis. Its neighborhoods include Armatage, East Harriet, Fulton, Kenny, Linden Hills and Lynnhurst. Incumbent Linea Palmisano was elected to City Council in 2013 after serving as board chair of the Linden Hills Neighborhood Council and as an assistant track coach at Southwest High School. She founded NAVIGATE, an immigrant college access program, and was a board member for the Linden Hills Farmers Market. She previously worked at IBM Global Services, UnitedHealth Group, and a local small business. Website. Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Liz Sawyer", "date": "JANUARY 31, 2025 AT 1:24PM", "text": "In first Minneapolis police graduation of 2025, officials hail ‘turning point’ in department’s history Applications are way up and pipeline of diverse new officers signals positive trajectory for police force following years of attrition. By Liz Sawyer The Minnesota Star Tribune JANUARY 31, 2025 AT 1:24PM Minneapolis Police recruit Mohamed S. Qasim took his oath alongside 18 others at Sabathani Community Center in Minneapolis, Minn., on Thursday, Jan. 30, 2025. (Richard Tsong-Taatarii/The Minnesota Star Tribune) For his keynote address to Minneapolis' newest crop of police officers, Spike Moss delivered a history lesson about the long, winding road to achieve minority representation on the force. The trailblazing civil rights activist organized for decades to help break barriers in the overwhelmingly white Police Department, pushing not only to place Black people in uniform but to see them reach the highest echelons of leadership. “I thought I was gonna lose my life just to get us in the door,” Moss told a standing-room-only crowd that had gathered Thursday night at Sabathani Community Center in south Minneapolis to celebrate the Police Academy graduates. But he said he lived long enough to witness that transformation. “This is our vanguard, our front line of protection,” he said, looking at the 19 young men — Black, white, Latino and Asian — as they waited to have their badges pinned. “These people here don’t represent that past that I was fighting with.” https://www.startribune.com/in-first-minneapolis-police-graduation-of-2025-officials-hail-turning-point-in-departments-history/601215006 1/5 2/4/25, 10:44 AM In first Minneapolis police graduation of 2025, officials hail ‘turning point’ in department’s history bias: Lean Left Bias split across 4 sources 25% 75% Other sources Civil rights leader Spike Moss was the keynote speaker at a Minneapolis Police Academy graduation at Sabathani Community Center on Thursday, Jan. 30, 2025.] (Richard Tsong- Taatarii/The Minnesota Star Tribune) In a city that still bears the physical and emotional scars of George Floyd’s murder in 2020 under the knee of a Minneapolis officer, Moss pointed to other signs of progress. Police chiefs are now willing to fire problem officers, he said, and county attorneys are unafraid to charge them. Several officers accused of serious misconduct, including the four involved in Floyd’s death, have been criminally convicted. The all-male class is joining the department at a time of rapid change amid two court-mandated reform efforts seeking to rebuild public trust and replenish the depleted police ranks. Many fresh recruits said they’re not intimidated by the challenge. “I felt like I had a golden ticket I couldn’t say no to,” said officer Mohamed Qasim, a 23-year-old Southwest High School graduate who jumped at the opportunity to patrol the city where he spent his childhood. The idea of doing noble work, while representing the growing Somali-American population, made him beam with pride. Mayor Jacob Frey and Chief Brian O’Hara hailed a “turning point” in their recruitment efforts following years of rapid decline. For the first time since 2018, the department ended the calendar year with a net increase of officers, adding 36 sworn staff after a targeted marketing push and a historic pay increase. “We’re on a much stronger trajectory,” said O’Hara, noting that 85 more people are in line to become cadets, community service officers or interns. Applications jumped by 133% by the end of 2024, partly driven by an influx of lateral hires, legacy recruits and a monthslong “Imagine Yourself” campaign that flooded social media with ads aimed at rebranding modern policing. When O’Hara was hired in 2022, the staffing shortage had become so dire advisers cautioned he may need to close a precinct. Veteran officers, plagued by low morale, strongly discouraged friends and family from joining the department. “It was a really dark place,” O’Hara said, recalling the elevated levels of violent crime and sense of numbness in the community. “The odds were very, very stacked against us.” https://www.startribune.com/in-first-minneapolis-police-graduation-of-2025-officials-hail-turning-point-in-departments-history/601215006 2/5 2/4/25, 10:44 AM In first Minneapolis police graduation of 2025, officials hail ‘turning point’ in department’s history The rank-and-file hit an all-time low of 560 last March, down from more than 900 in early 2020, according to payroll data. Today, that number is back above 580, and O’Hara said some officers now eligible for breiatsir:eLmeeann tL aerfte oBpiatsi nsgp ltito a sctraoys.s 4 sources 25% 75% Other sources “They feel good about what they do again,” he said. At least a dozen immediate relatives of current cops have also joined the force in recent months. It’s a promising turnaround nearly five years after Floyd’s killing — and amid a recent consent decree with the U.S. Department of Justice over its findings the department engaged in a pattern of racist policing practices. That latest reform effort, the most sweeping to date, has yet to be signed by a federal judge. Its future remains in jeopardy, given that the Trump administration froze all federal civil rights litigation last week. The city says it is committed to that work and will pursue the current terms of the agreement, regardless of the federal government’s involvement. Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Deena Winter", "date": "JANUARY 29, 2025 AT 7:54AM", "text": "Minneapolis Mayor Jacob Frey says he’ll run for third — and final — term Frey says he’s running for one last term to “see this job through.” He faces several challengers. By Deena Winter The Minnesota Star Tribune JANUARY 29, 2025 AT 7:54AM Minneapolis Mayor Jacob Frey gives his State of the City speech to a crowd at the Northstar Center in Minneapolis on May 7, 2024. (Renée Jones Schneider/The Minnesota Star Tribune) Minneapolis Mayor Jacob Frey says he’s running for a third term, which would be his last four years at the helm of a city he led through a pandemic and police brutality case that rocked the world. Frey served on the City Council from 2013 until he was elected mayor in 2017, and was in the job for two years before the COVID-19 pandemic struck and Minneapolis police killed George Floyd in 2020. “I’m running because I love this city, and we got to get the job done, and our city has come through the adversity of big city challenges over the last several years, and we’re coming back with real results,” he said in an interview. “I want to see this job through. I want to see the work through to set the next mayor up for success, and the city up for success.” He said if re-elected, he would not run for a fourth term. “This will be my final term,” he said. Frey has become a controversial figure in the Democratic stronghold of Minneapolis. Those on the far left, including those in control of the City Council, regularly clash with him over issues such as homeless encampments, a call for a ceasefire to the Israel-Hamas war and how much Uber and Lyft drivers’ pay should increase. “Right now, we need people with the courage to tell their own side what they don’t want to hear,” Frey said. “Say what you want about me: I’ve had the guts to stand up and do what’s right, even when it’s tough. And the positions that I’ve taken may not have been immediately popular, but over time, they’ve been proven to be the right thing for our city. Not some special interest group, but our city.” For example, he said, he opposed rent control because “it doesn’t work,” and told a throng of people who showed up at his doorstep he wouldn’t support defunding the police. https://www.startribune.com/minneapolis-mayor-jacob-frey-running-reelection-2025/601213414 1/5 2/4/25, 10:43 AM Minneapolis Mayor Jacob Frey is running for re-election in 2025 bias: Lean Left Bias split across 6 sources 33% 50% 17%Other sources +2 “It was not easy to tell 2,000 people outside my apartment that I wasn’t going to do the thing they were demanding, but it was right,” he said. Minneapolis Mayor Jacob Frey listens as Police Chief Brian O’Hara speaks during a press conference announcing the launch of a multi-year, comprehensive recruitment campaign for 911 and Minneapolis Police Department positions at the City of Minneapolis Public Service Building in Minneapolis last March. (Aaron Lavinsky/The Minnesota Star Tribune) Progress on affordable housing, policing Frey touts the city as a national leader in providing affordable housing, creating 8.5 times more affordable homes than in the past. He also points to the rebuilding of the police force after a wave of resignations and retirements in the wake of Floyd’s murder by police. Last year was the first time in five years that the Minneapolis Police Department ended the year with a net increase of officers, adding 36 officers after a recruitment campaign and significant pay increase. He also points to another change, creation of a new Office of Community Safety. The city now diverts about 9% of its calls for service to alternate responders, such as a behavioral crisis response team. People often come into office thinking they’re going to change it, but instead more often the office changes them, Frey said. “What you get over time is you get thicker skin, and you get the courage to do the right thing, even when it’ll subject you to a pummeling at times from both sides,” he said. “What we can’t have right now is people that flip their positions all over, depending on when the political winds are blowing.” He is being challenged in the election by the Rev. DeWayne Davis, state Sen. Omar Fateh, City Council Member Emily Koski, Jazz Hampton and Brenda Short. Experience dealing with Trump administration As Donald Trump begins his second term as president, Frey notes he’s been here before, having been mayor during Trump’s first tumultuous term. “I’ve heard quite a few people on the council and beyond talk about having to counter Donald Trump by pushing further left,” he said. “The opposite of extremism is not the opposite extreme.” Even though Trump will undoubtedly rock the city’s boat in various ways, Frey vows this year Minneapolis is staging a comeback. “I think this year will be very much like, you know, it’s been like the duck paddling furiously beneath the surface, but people can’t see the work that’s happening. 2025 will be the year that a lot of this work comes to fruition. People will truly start to see things rebound in a beautiful way.” Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Christopher Magan", "date": "FEBRUARY 1, 2025 AT 2:31PM", "text": "Minneapolis police arrest two after shooting during alleged drug deal The victim was taken to HCMC with injuries that were not life-threatening Saturday afternoon. By Christopher Magan The Minnesota Star Tribune FEBRUARY 1, 2025 AT 2:31PM Minneapolis Police Department (Minneapolis Police Department) Minneapolis police arrested two people Saturday afternoon in connection with a shooting that occurred during an alleged drug deal. Third Precinct officers responded shortly after 12:30 p.m. to a report of a shooting near 22nd Avenue S. and E. Franklin Avenue. There they found a man with a non-life-threatening injury, who was then transported to HCMC. In a statement, police said a preliminary investigation indicated the man was inside a nearby apartment when he was shot during a drug deal. He fled the apartment and called 911. Officers located the apartment, in the 2000 block of 21st Avenue S., but found no one inside. They gathered information about the two suspects and relayed the details to other officers, who were able to locate the suspects getting onto a bus several miles away. Both were arrested without incident, and the shooting remains under investigation. Police Chief Brian O’Hara praised the “swift, coordinated efforts” of officers, saying in a statement: “Their work exemplifies the relentless commitment of the Minneapolis Police Department to ensuring justice for victims and removing dangerous criminals from our streets. We will continue to use every resource available to combat crime and violence and protect the people of Minneapolis.” Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Sarah Ritter andMaya Rao", "date": "FEBRUARY 2, 2025 AT 5:40PM", "text": "University of Minnesota law school is halting search for new DEI leader in response to Trump’s ban The university also is requiring all communications related to diversity, equity and inclusion be reviewed by attorneys. By Sarah Ritter andMaya Rao The Minnesota Star Tribune FEBRUARY 2, 2025 AT 5:40PM The University of Minnesota is tightening up its messaging about diversity work, by implementing a new systemwide policy requiring legal counsel to review all internal and external communications related to DEI. (Angelina Katsanis/The Minnesota Star Tribune) The University of Minnesota law school is pausing the search for its next assistant dean of diversity, equity, and inclusion as administrators navigate President Donald Trump’s ban of DEI programs in the federal government. The university also is tightening up its messaging about diversity work, by implementing a new systemwide policy requiring legal counsel to review all internal and external communications related to DEI. Spokesman Jake Ricker said the university is not rolling back diversity, equity and inclusion or making preemptive changes to existing programs. But he said the university is moving forward cautiously, including by freezing the new hire, while administrators seek clarity on the White House directives. President Trump has aggressively moved to abolish diversity and inclusion offices and programs across the U.S. government by leveraging federal money. Higher education relies on federal dollars for many programs, research projects and contract work. Trump has called for investigations into whether some schools with endowments over $1 billion are complying with his orders. Universities are scrambling in response to the edicts, with some colleges renaming programs, assessing titles, suspending research projects and canceling events related to diversity. Others are remaining quiet or vowing to continue DEI initiatives. At the University of Minnesota, law school Dean William McGeveran said in a Friday email, provided to the Star Tribune, that as the university reassesses its programs related to diversity, it became “clear that we have no choice” but to halt the search for a new assistant dean of diversity, equity and inclusion. He said scheduled visits with finalists were canceled. bias: Lean Left Bias split across 3 sources 33% 67% Other sources +-1 https://www.startribune.com/university-minnesota-law-pausing-dei-leader-hire/601215934 1/5 2/4/25, 10:44 AM University of Minnesota law school pausing hiring of DEI leader “This is a disappointing development for many, and I know it brings questions and uncertainty for our community,” McGeveran said in the email. “My commitment to supporting all of our students, faculty, and staff remains unchanged, as does the Law School’s mission of building a legal profession representative of the people it serves.” McGeveran added that many “important programs will continue, both at the Law School and across the university.” In addition, the university will conduct legal reviews of all external and internal communications related to DEI, according to an email Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
{"author": "By Kyeland Jackson", "date": "FEBRUARY 1, 2025 AT 2:15PM", "text": "Marvina Haynes, advocate for those wrongfully convicted, will run for Minneapolis City Council Haynes and others called for more like-minded candidates to run for office this year. By Kyeland Jackson The Minnesota Star Tribune FEBRUARY 1, 2025 AT 2:15PM Marvin Haynes and his sister Marvina Haynes, who successfully fought for his exoneration after serving nearly 20 years in prison after a wrongful murder conviction. Marvina Haynes announced she is running for the Minneapolis City Council. (Renée Jones Schneider, Star Tribune/The Minnesota Star Tribune) A woman who spent years working to exonerate her brother for a murder he did not commit has announced she will run for the Minneapolis City Council. Marvina Haynes, 40, announced her bid for the Ward 4 seat at a news conference Saturday. She plans to run under the DFL Party banner and advocate for public safety, homeless residents, environmental justice and education. Haynes will challenge incumbent LaTrisha Vetaw, who was elected to the council in 2021 after directing health policy and advocacy at Northpoint Health & Wellness, Inc. for more than a decade. Haynes worked for years to free her brother Marvin, who spent 19 years in prison before being exonerated for faulty evidence and released. She founded MN Wrongfully Convicted Judicial Reform, an organization to help families affected by wrongful convictions. “I know exactly what my constituents need because I have spoken with them,” she said. “They are my neighbors. They look like me. They have felt the trauma and pain that our current administration has continued to lay down on us.” Haynes added that Minneapolis residents need a city “where our youth can thrive, where our families can prosper, where our businesses look like our neighbors.” Last year was a contentious one for the City Council. Besides weighing in on the war between Israel and Hamas, council members passed a new police contract, added a fee for carbon emissions and placed a $15 minimum price on cigarette packs. They also clashed on the fate of the former Third Precinct police station and the future of George Floyd Square. https://www.startribune.com/marvina-haynes-advocate-for-those-wrongfully-convicted-will-run-for-minneapolis-city-council/601215454 1/4 2/4/25, 10:44 AM Marvina Haynes announces run for Minneapolis City Council The mayor’s office and all 13 City Council seats will be up for election on Nov. 4, “We’re really excited for other candidates to step up because we want a whole slate of City Council members and a mayoral slate,” said Sam Graystar, director of the advocacy organization STAR MPLS. “We know that this is a two-party system that isn’t working for anyone at this point unless you’re super rich.” Deena Winter of the Minnesota Star Tribune contributed to this story. Minneapolis touts progress in police reforms, but lags in closing out complaints and force reviews Inmate escaped as he awaited transfer from Hennepin County jail"}
